using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace MyHomework1
{
    class Program
    {
        static void Main(string[] args)
        {/*Дан массив размера N. Отсортируйте его по возрастанию методом "Быстрой 
            сортировки". Отличительной особенностью быстрой сортировки является операция 
            разбиения массива на две части относительно опорного элемента. Например, если
            последовательность требуется упорядочить по возрастанию, то в левую часть будут 
            помещены все элементы, значения которых меньше значения опорного элемента, а в 
            правую элементы, чьи значения больше или равны опорному. Вне зависимости от 
            того, какой элемент выбран в качестве опорного, массив будет отсортирован, но все 
            же наиболее удачным считается ситуация, когда по обеим сторонам от опорного 
            элемента оказывается примерно равное количество элементов. Если длина какой-то 
            из получившихся в результате разбиения частей превышает один элемент, то для нее 
            нужно рекурсивно выполнить упорядочивание, т.е. повторно запустить алгоритм на 
            каждом из отрезков.
            Таким образом, алгоритм быстрой сортировки включает в себя два основных этапа:
            1. Разбиение массива относительно опорного элемента;
            2. Рекурсивная сортировка каждой части массива.*/


            int[] nums = {8, 3, 6, 7, 9, 11, 2};
            Console.WriteLine();
            
            


        }
    }
}
